src/test/resources/jaxws/jbws2901/attack-message-1.xml

<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<!DOCTYPE x[
<!ENTITY showme SYSTEM "http://localhost:8080/jaxws-jbws2901/passwd">
]
>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jbw="http://jbws2901.jaxws.ws.test.jboss.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <jbw:echoString>
         <!--Optional:-->
         <arg0>&showme;</arg0>
      </jbw:echoString>
   </soapenv:Body>
</soapenv:Envelope>
